<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Imports the local ImPACT testing app into munki from the zip. You must supply pathname and version at the command line (ex. autopkg run -v --key pathname=~/Downloads/LocalInstallPlus__v4.000.zip --key version=4.000 ImPACT.munki.recip). At the time of this writing the Info.plist shows version as 1.0.0.0 and the site says 4.00 for OS X.</string>
    <key>Identifier</key>
    <string>com.github.rmanly.munki.ImPACT</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>ImPACT</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/ImPACT</string>
      <key>DESTINATION_PATH</key>
      <string>/Applications</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string></string>
        <key>description</key>
        <string>Local Installation of ImPACT testing app.</string>
        <key>developer</key>
        <string>ImPACT Applications, Inc</string>
        <key>display_name</key>
        <string>ImPACT Testing's Local Instapp App</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
      </dict>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%pathname%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>version</key>
            <string>%version%</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%dmg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
          <key>additional_makepkginfo_options</key>
          <array>
            <string>--item</string>
            <string>LocalInstallPlus</string>
            <string>--destinationpath</string>
            <string>%DESTINATION_PATH%</string>
            <string>--owner</string>
            <string>root</string>
            <string>--group</string>
            <string>admin</string>
            <string>--mode</string>
            <string>go-w</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
