<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Imports the latest Zidget widget into munki</string>
    <key>Identifier</key>
    <string>com.github.rmanly.munki.Zidget</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Zidget</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/Acronis/Zidget</string>
      <key>DESTINATION_PATH</key>
      <string>/Library/Widgets</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string></string>
        <key>description</key>
        <string>Zidget is a Dashboard Widget that the Macintosh user can use to discover and connect to a file server whether or not the server is in the user’s local subnet. Zidget also allows the Macintosh user to browse DFS namespaces that are shared through the ExtremeZ-IP server. Using Zidget, the Macintosh user can also browse for and add ExtremeZ-IP printers.</string>
        <key>developer</key>
        <string>Acronis International GmbH</string>
        <key>display_name</key>
        <string>Zidget Dashboard Widget</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>unattended_uninstall</key>
        <true/>
      </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rmanly.download.Zidget</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/Zidget.wdgt/Info.plist</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>version</key>
            <string>%version%</string>
            <key>installcheck_script</key>
            <string>#!/usr/bin/python

from plistlib import readPlist
from distutils.version import StrictVersion

# assuming if there is an IOError it is because it is not installed
try:
    info = readPlist('/Library/Widgets/Zidget.wdgt/Info.plist')
except IOError:
    exit(0)

current_version = info['CFBundleVersion']

# if the version obtained by AutoPkg is greater than the version on the system
if StrictVersion('%version%') > StrictVersion(current_version):
    exit(0)
else:
    exit(1)
</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%dmg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
          <key>additional_makepkginfo_options</key>
          <array>
            <string>--item</string>
            <string>Zidget.wdgt</string>
            <string>--destinationpath</string>
            <string>%DESTINATION_PATH%</string>
            <string>--owner</string>
            <string>root</string>
            <string>--group</string>
            <string>admin</string>
            <string>--mode</string>
            <string>go-w</string>
          </array>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
