<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.rmanly.download.Zidget</string>
    <key>Input</key>
    <dict>
      <!-- extremezipserverlist is should be a CNAME pointing
      to one of the print servers you have running ExtremeZ-IP.
      Be sure to change as needed for your environment. -->
      <key>HOSTNAME</key>
      <string>extremezipserverlist.glenbrook225.org</string>
      <key>NAME</key>
      <string>Zidget</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>http://%HOSTNAME%:8081/Zidget.wdgt.zip</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%pathname%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
